---
kind: property
id: P:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileOffset
source: html/a6acee14-128e-9508-e41b-73bb6dee0804.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.ProfileOffset Property

The offset which is applied to a family-defined profile in the
 direction away from the division line and toward left/upper part
 to obtain its profile.

## Syntax (C#)
```csharp
public double ProfileOffset { get; set; }
```